# ExtensionUtility Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..ExtensionUtility Property
FamilyInstance Class See Also
---
Property to check whether the instance can be extended and return the interface for extension operation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IExtension ExtensionUtility { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExtensionUtility As IExtension
	Get
```

Visual C++
---
```text
public:
property IExtension^ ExtensionUtility {
	IExtension^ get ();
}
```

# Remarks
If the family instance can not support extension operation, it returns nullNothingnullptra null reference (Nothing in Visual Basic)
# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace